docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-13 Sat 13:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project State</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Hee Hwang" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Project State</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4a72606">Week1 Notes <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-02-02 Tue&gt;</span></span></a>
<ul>
<li><a href="#org0a3902a">Present at meeting <code>[6/6]</code></a></li>
<li><a href="#org3998463">Agenda</a></li>
<li><a href="#org8ade042">Notes</a>
<ul>
<li><a href="#orgccf2490">Goal: Publish a paper</a></li>
<li><a href="#org2b4da1f">Topic: NLP Data Augmentation</a></li>
<li><a href="#org7fd75be">Focus on Classification Tasks</a></li>
<li><a href="#org07d0040">Evaluation:</a></li>
<li><a href="#org7110741">Shared Vector Embedding space is enormous. Focus on a small subset.</a></li>
<li><a href="#org81f2b83">Will discuss further after setting up toy retrieval pipeline</a></li>
<li><a href="#org594243f">May be able to get Oracle’s previous research on retrieval</a></li>
<li><a href="#org7419a0a">Don’t stop Pretraining embedding</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf6a6e07"><span class="done DONE">DONE</span> Action #1 Choose Data <code>[100%]</code></a></li>
<li><a href="#orga99754b"><span class="done DONE">DONE</span> Action #2 Select Embedding <code>[100%]</code></a></li>
<li><a href="#org13d648b"><span class="todo IN_PROGRESS">IN PROGRESS</span> Action #3 Build Basic Classification Pipeline <code>[50%]</code></a></li>
<li><a href="#orga24d122"><span class="todo TODO">TODO</span> Action #4 Retrieval Strategy <code>[40%]</code></a></li>
<li><a href="#orgb2e1a25"><span class="todo WAITING">WAITING</span> Action #5 Acquire Previous Work from Oracle <code>[0%]</code></a></li>
<li><a href="#orge8df364"><span class="todo IN_PROGRESS">IN PROGRESS</span> Action #6 Collect Relevant Papers <code>[60%]</code></a></li>
</ul>
</div>
</div>



<div id="outline-container-org4a72606" class="outline-2">
<h2 id="org4a72606">Week1 Notes <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-02-02 Tue&gt;</span></span></h2>
<div class="outline-text-2" id="text-org4a72606">
</div>
<div id="outline-container-org0a3902a" class="outline-3">
<h3 id="org0a3902a">Present at meeting <code>[6/6]</code></h3>
<div class="outline-text-3" id="text-org0a3902a">
<ul class="org-ul">
<li class="on"><code>[X]</code> Peter</li>
<li class="on"><code>[X]</code> Sudarshan</li>
<li class="on"><code>[X]</code> Kalpesh</li>
<li class="on"><code>[X]</code> Ari</li>
<li class="on"><code>[X]</code> Sweta</li>
<li class="on"><code>[X]</code> Mike</li>
</ul>
</div>
</div>

<div id="outline-container-org3998463" class="outline-3">
<h3 id="org3998463">Agenda</h3>
<div class="outline-text-3" id="text-org3998463">
<ul class="org-ul">
<li>Logistics</li>
<li>Project Intro</li>
<li>Discussion</li>
</ul>
</div>
</div>

<div id="outline-container-org8ade042" class="outline-3">
<h3 id="org8ade042">Notes</h3>
<div class="outline-text-3" id="text-org8ade042">
</div>
<div id="outline-container-orgccf2490" class="outline-4">
<h4 id="orgccf2490">Goal: Publish a paper</h4>
</div>
<div id="outline-container-org2b4da1f" class="outline-4">
<h4 id="org2b4da1f">Topic: NLP Data Augmentation</h4>
<div class="outline-text-4" id="text-org2b4da1f">
</div>
<ul class="org-ul">
<li><a id="org5722f81"></a>Approach<br />
<div class="outline-text-5" id="text-org5722f81">
<ul class="org-ul">
<li>Find existing examples within large corpus such as Common Crawl using embedding</li>
<li>Generating from scratch(May not efficient)</li>
<li>Modifying existing data(Style Transfer, …)</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org7fd75be" class="outline-4">
<h4 id="org7fd75be">Focus on Classification Tasks</h4>
<div class="outline-text-4" id="text-org7fd75be">
</div>
<ul class="org-ul">
<li><a id="org4cefa68"></a>Ari's suggestion:<br />
<div class="outline-text-5" id="text-org4cefa68">
<ul class="org-ul">
<li>Intent Classification on banking domain (Open a bank account)</li>
<li>Sentiment Classification(3 classes)</li>
</ul>
</div>
</li>
<li><a id="orgfb44f12"></a>Kalpesh:<br />
<div class="outline-text-5" id="text-orgfb44f12">
<ul class="org-ul">
<li>Citation intent classification</li>
<li>Topic Classification</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org07d0040" class="outline-4">
<h4 id="org07d0040">Evaluation:</h4>
<div class="outline-text-4" id="text-org07d0040">
<ul class="org-ul">
<li>Held-out Test Accuracy</li>
<li>Adversarial held-out accuracy</li>
<li>Checklist Evaluation for Linguistic Generalization</li>
<li>Kalpesh: 10-15 Test Datasets for generalization - Which paper?</li>
</ul>
</div>
</div>

<div id="outline-container-org7110741" class="outline-4">
<h4 id="org7110741">Shared Vector Embedding space is enormous. Focus on a small subset.</h4>
<div class="outline-text-4" id="text-org7110741">
<ul class="org-ul">
<li>Linguistic phenomena</li>
<li>TF-IDF</li>
<li>Prefix String</li>
<li>Kalpesh: Dense Embedding(DPR)</li>
</ul>
</div>
</div>

<div id="outline-container-org81f2b83" class="outline-4">
<h4 id="org81f2b83">Will discuss further after setting up toy retrieval pipeline</h4>
</div>
<div id="outline-container-org594243f" class="outline-4">
<h4 id="org594243f">May be able to get Oracle’s previous research on retrieval</h4>
<div class="outline-text-4" id="text-org594243f">
<ul class="org-ul">
<li>Collecting the farthest embedding.</li>
<li>May collect irrelevant data. Thus, think about other way</li>
<li>e.g. Collect task-relevant examples and take the farthest embedding</li>
</ul>
</div>
</div>
<div id="outline-container-org7419a0a" class="outline-4">
<h4 id="org7419a0a">Don’t stop Pretraining embedding</h4>
</div>
</div>
</div>

<div id="outline-container-orgf6a6e07" class="outline-2">
<h2 id="orgf6a6e07"><span class="done DONE">DONE</span> Action #1 Choose Data <code>[100%]</code></h2>
<div class="outline-text-2" id="text-orgf6a6e07">
<ul class="org-ul">
<li class="on"><code>[X]</code> <p>
Toy Classification Data
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">IMDB</td>
<td class="org-left"><a href="https://allennlp.s3-us-west-2.amazonaws.com/dont_stop_pretraining/data/imdb/train.jsonl">https://allennlp.s3-us-west-2.amazonaws.com/dont_stop_pretraining/data/imdb/train.jsonl</a></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://allennlp.s3-us-west-2.amazonaws.com/dont_stop_pretraining/data/imdb/test.jsonl">https://allennlp.s3-us-west-2.amazonaws.com/dont_stop_pretraining/data/imdb/test.jsonl</a></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://allennlp.s3-us-west-2.amazonaws.com/dont_stop_pretraining/data/imdb/dev.jsonl">https://allennlp.s3-us-west-2.amazonaws.com/dont_stop_pretraining/data/imdb/dev.jsonl</a></td>
</tr>
</tbody>
</table></li>
<li class="on"><code>[X]</code> Augmentation Data
<ul class="org-ul">
<li>Common Crawl raw text: <a href="https://commoncrawl.s3.amazonaws.com/contrib/depcc/CC-MAIN-2016-07/index.html">https://commoncrawl.s3.amazonaws.com/contrib/depcc/CC-MAIN-2016-07/index.html</a></li>
<li>Downloaded raw text on UMass gypsum cluster(468 GB with compression)</li>
<li>Need to tokenize it at a paragraph level</li>
<li>Sentence Level: gypsum:://mnt/nfs/work1/miyyer/datasets/depcc</li>
<li>Other Data: <a href="https://github.com/EleutherAI/the-pile">https://github.com/EleutherAI/the-pile</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga99754b" class="outline-2">
<h2 id="orga99754b"><span class="done DONE">DONE</span> Action #2 Select Embedding <code>[100%]</code></h2>
<div class="outline-text-2" id="text-orga99754b">
<ul class="org-ul">
<li class="on"><code>[X]</code> Get better semantic representation(embedding) by pre-training with relevant domain corpus
<ul class="org-ul">
<li>ROBERTA, ROBERTA-DAPT, and ROBERTA-TAPT are available online.</li>
<li><a href="https://huggingface.co/allenai">https://huggingface.co/allenai</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org13d648b" class="outline-2">
<h2 id="org13d648b"><span class="todo IN_PROGRESS">IN PROGRESS</span> Action #3 Build Basic Classification Pipeline <code>[50%]</code></h2>
<div class="outline-text-2" id="text-org13d648b">
<ul class="org-ul">
<li class="on"><code>[X]</code> Download IMDB Data(train/test/dev) used in <a href="https://github.com/allenai/dont-stop-pretraining">https://github.com/allenai/dont-stop-pretraining</a></li>
<li class="off"><code>[&#xa0;]</code> Fine-tune ROBERTA with hyperparameters from <a href="https://github.com/allenai/dont-stop-pretraining/blob/master/environments/hyperparameters.py">https://github.com/allenai/dont-stop-pretraining/blob/master/environments/hyperparameters.py</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga24d122" class="outline-2">
<h2 id="orga24d122"><span class="todo TODO">TODO</span> Action #4 Retrieval Strategy <code>[40%]</code></h2>
<div class="outline-text-2" id="text-orga24d122">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Don’s stop pretraining (Focus on last few chapters)
<ul class="org-ul">
<li>They augment data by using VAMPIRE, a variational auto encoder with simple bag-of-words</li>
<li>Replication(Pretraining) Failed. But the dataset, model, and classification task is good</li>
<li>Definitely good for a baseline</li>
</ul></li>
<li class="on"><code>[X]</code> VAMPIRE(<a href="https://github.com/allenai/vampire">https://github.com/allenai/vampire</a>)
<ul class="org-ul">
<li>This is the augmentation method for the previous paper "don't stop pretraining"</li>
<li>Got it working without any issue.</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Unsupervised Clustering <a href="https://arxiv.org/pdf/2004.02105.pdf">https://arxiv.org/pdf/2004.02105.pdf</a></li>
<li class="off"><code>[&#xa0;]</code> Better Retrieval Strategy</li>
<li class="on"><code>[X]</code> <p>
Sudarshan's Previous work on KNN Cosine Similarity Retrieval
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6A9955;">#</span><span style="color: #6A9955;">This function reduces the size of the context by selecting top k passages in the context and concatenates them</span>
<span style="color: #569cd6;">def</span> <span style="color: #DCDCAA;">get_final_context_strings</span>(questions, answers, context):
  <span style="color: #9cdcfe;">top_k</span> = 3 <span style="color: #6A9955;"># </span><span style="color: #6A9955;">Choose number of top passages to concatenate. Typical is 3 for Longformer.</span>
  <span style="color: #9cdcfe;">context_embeddings</span> = get_context_embeddings(context)
  <span style="color: #9cdcfe;">num_questions</span> = <span style="color: #C586C0;">len</span>(questions)
  <span style="color: #9cdcfe;">num_answers</span> = <span style="color: #C586C0;">len</span>(answers)
  <span style="color: #9cdcfe;">final_contexts</span> = [[] <span style="color: #569cd6;">for</span> i <span style="color: #569cd6;">in</span> <span style="color: #C586C0;">range</span>(num_questions)]
  <span style="color: #9cdcfe;">final_context_strings</span> = [<span style="color: #CE9178;">""</span> <span style="color: #569cd6;">for</span> i <span style="color: #569cd6;">in</span> <span style="color: #C586C0;">range</span>(num_questions)]
  <span style="color: #9cdcfe;">top_k_sentences</span> = []

  <span style="color: #569cd6;">with</span> torch.no_grad():
    <span style="color: #9cdcfe;">question_embeddings</span> = torch.from_numpy(model_ir.encode(questions)) <span style="color: #6A9955;"># </span><span style="color: #6A9955;">-&gt; Tensor, Size: Number of Questions x Embedding Size</span>
  <span style="color: #9cdcfe;">cos_sim_sentences</span> = util.pytorch_cos_sim(question_embeddings, context_embeddings) <span style="color: #6A9955;"># </span><span style="color: #6A9955;">Use cosine simularity to rate sentences. -&gt; Tensor, Size: Number of Questions x Number of Passages in Context</span>
  <span style="color: #9cdcfe;">top_k_sentences</span> = torch.topk(cos_sim_sentences,top_k)[1] <span style="color: #6A9955;">#</span><span style="color: #6A9955;">Indices Tensor (Size: Number of Questions x Indices of Top k Values in Context) - Discard values tensor at index 0</span>
  <span style="color: #9cdcfe;">sorted_indices</span> = torch.sort(top_k_sentences,dim=-1)[0] <span style="color: #6A9955;">## </span><span style="color: #6A9955;">Sort sentences into document order to preserve structure, removing extra indices tensor from sort fxn. -&gt; Indices Tensor (Size: Number of Questions x Indices of Top k Values in Context)</span>
  <span style="color: #9cdcfe;">sorted_indices_list</span> = sorted_indices.tolist()

  <span style="color: #569cd6;">for</span> qxn <span style="color: #569cd6;">in</span> <span style="color: #C586C0;">range</span>(num_questions): <span style="color: #6A9955;"># </span><span style="color: #6A9955;">Build all the final contexts</span>
    <span style="color: #569cd6;">for</span> chunk <span style="color: #569cd6;">in</span> sorted_indices_list[qxn]:
      final_contexts[qxn].append(sentences[chunk])
    <span style="color: #9cdcfe;">final_context_strings</span>[qxn] = <span style="color: #CE9178;">" "</span>.join(final_contexts[qxn])

  <span style="color: #569cd6;">return</span> final_context_strings
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgb2e1a25" class="outline-2">
<h2 id="orgb2e1a25"><span class="todo WAITING">WAITING</span> Action #5 Acquire Previous Work from Oracle <code>[0%]</code></h2>
<div class="outline-text-2" id="text-orgb2e1a25">
<ul class="org-ul">
<li>For better retrieval</li>
<li class="off"><code>[&#xa0;]</code> Waiting for response</li>
</ul>
</div>
</div>


<div id="outline-container-orge8df364" class="outline-2">
<h2 id="orge8df364"><span class="todo IN_PROGRESS">IN PROGRESS</span> Action #6 Collect Relevant Papers <code>[60%]</code></h2>
<div class="outline-text-2" id="text-orge8df364">
<ul class="org-ul">
<li class="on"><code>[X]</code> Pre-trained Embedding
<ul class="org-ul">
<li><a href="./papers/1810.04805.pdf">Bert: Pre-training of deepbidirectional transformers for language understand-ing.(2019)</a></li>
<li><a href="./papers/1907.11692.pdf">RoBERTa: A Robustly Optimized BERT Pretraining Approach(2019)</a></li>
<li><a href="./papers/2004.10964.pdf">Don’t stop pretraining:Adapt language models to domains and tasks.(2020)</a></li>
</ul></li>

<li class="on"><code>[X]</code> Retrieval Strategy
<ul class="org-ul">
<li><a href="./papers/1906.02242.pdf">VAMPIRE:Variational Pretraining for Semi-supervised Text Classification(2019)</a></li>
<li><a href="./papers/2004.02105.pdf">Unsupervised domain clusters in pretrained language models.(2020)</a></li>
<li><a href="./papers/1707.07328.pdf">Adversarial examples for evaluating reading comprehension systems.(2017)</a></li>
<li><a href="./papers/2004.04906.pdf">Dense Passage Retrieval for Open-Domain Question Answering(2020)</a></li>
</ul></li>

<li class="on"><code>[X]</code> Robustness
<ul class="org-ul">
<li><a href="./papers/1804.07998.pdf">Generating natural language adversarial examples.(2018)</a></li>
<li><a href="./papers/1909.12434.pdf">Learning the difference that makes a difference with counterfactually-augmented data.(2019)</a></li>
<li><a href="./papers/1804.06059.pdf">Adversarial example generation with syntactically controlled paraphrase networks.(2018)</a></li>
</ul></li>

<li class="off"><code>[&#xa0;]</code> Linguistic Generalization
<ul class="org-ul">
<li><a href="./papers/2005.04118.pdf">Beyond Accuracy: Behavioral Testing of NLP Models with CheckList(2020)</a></li>
<li><a href="./papers/2004.11999.pdf">Syntacticdata augmentation increases robustness to inference heuristics.(2020)</a></li>
</ul></li>

<li class="off"><code>[&#xa0;]</code> Style Transfer
<ul class="org-ul">
<li><a href="./papers/2010.05700.pdf">Reformulating Unsupervised Style Transferas Paraphrase Generation(2020)</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Hee Hwang</p>
<p class="date">Created: 2021-02-13 Sat 13:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
